Documents/ESB/ESB_Consumer_0916/003TestSample/SAMPLE_XML_MUST/BankCard/BC01_BankCardSummInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/BankCard/BankCardSummInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>BankCard</ServiceDomain>  
      <OperationName>BankCardSummInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:BankCardSummInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>BC01</v11:TxnId>  
        <v11:TxnNo>BC0100001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId>  
        <!--Optional:-->  
        <v11:CustPswd>123456</v11:CustPswd> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:PageNo>1</v11:PageNo>  
        <v11:NoOfPage>1</v11:NoOfPage>  
        <v11:CardNo>4312340000036975</v11:CardNo> 
      </v11:ServiceBody> 
    </v11:BankCardSummInqRq> 
  </soap:Body> 
</soap:Envelope>
